%%%-------------------------------------------------------------------
%%% @author  zhoujiagen@gmail.com
%%% @copyright MIT
%%% @doc
%%% 
%%% @end
%%%-------------------------------------------------------------------


-module(test_map).
-include("common.hrl").

%% ====================================================================
%% API functions
%% ====================================================================
-export([run/0]).

run() ->
  % 创建
  % => 用于添加/更新
  % := 用于更新
  F1 = #{a => 1, b => 2},
  ?INFO("F1", F1),

  Facts = #{
    {wife, fred} => "Sue",
    {age, fred} => 45,
    {daughter, fred} => "Mary",
    {likes, jim} => [1, 2, 3]
  },
  ?INFO("Facts", Facts),

  % 操作: 添加/更新
  F2 = F1#{c => 3}, % 添加新键值
  ?INFO("F2", F2),

  F3 = F2#{c := 4}, % 更新键的值
  ?INFO("F3", F3),

  % 模式匹配
  Henry8 = #{class => king, born => 1491, died => 1547},
  #{born := Born} = Henry8, % 使用:=
  ?INFO("Born", Born)
.

%% ====================================================================
%% Internal functions
%% ====================================================================

